{
    "posts": [
        {
            "title": "Automation with Python",
            "date": "2019-02-19",
            "description": "Flutter Installation Download flutter from the official website (here). Create a folder in the Downloads folder called flutterSDK. Copy the flutter zip folder there and extract the folder there. In the extracted folder, there would be a bin folder. Copy the path of the bin folder. We’ll be using the copied path in the future. For Windows Users Press the windows key. Type ‘env’ and a search result stating Edit Environment Variables will popup. Open that screen and click on the Environment Variables button. In the PATH variable, click new to add the path copied in the previous step. Save all changes and reopen your Command Prompt. Run flutter to verify your changes. Be sure to add the Flutter path to the correct PATH variable. For MacOS/Linux Users Open terminal. Run nano .bash_profile. A window would open, write export PATH=path/to/bin/folder/copied/in/the/above/step/ Press ctrl+x to close the file.Press Y to save the file and then press enter. Run source .bash_profile Exit the terminal session. Open a new session, and run flutter doctor to confirm the installation.",
            "imgURL": "https://images.unsplash.com/photo-1494548162494-384bba4ab999?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&w=1000&q=80",
            "workshop": "true"
        },
        {
            "title": "Hacktoberfest in Bharati Vidyapeeth Pune",
            "date": "2019-10-07",
            "description": "Eulerian-Motion-Magnification Personal Details Name: Ashray Malhotra University: Indian Institute of Technology, Bombay Email: redacted (connect with me on linkedin) Telephone: redacted Instant Messaging: redacted Twitter: https://twitter.com/ashray_malhotra Country of Residence: India Timezone: IST (GMT + 0530) Primary Language: English I am a fourth year dual degree student pursuing B.Tech. + M.Tech. in Electrical Engineering(specialisation in Signal Processing) at Indian Institute of Technology, Bombay. My semester will complete in late April leaving me enough time to get ready for my GSoC project. If I am selected, I shall be able to work around 40 hrs a week on the project, though am open to putting in more effort if the work requires. Why this project? This technique of motion magnification unlocks completely new avenues like detection of blood vessels,magnify motions of small babies etc. I look at this technology from the perspective of enabling a whole new dimension of use cases. So our aim should be to provide it to users/developers in as flexible form as possible so that people can build upon it for their personal use cases that they can think of. Another advantage of this technique is that it can work in near real time. Hence it unlocks completely new avenues for technology. Technical Knowledge I am a 4th year dual degree student in IIT Bombay. I am enrolled in a 5 year B.Tech. + M.Tech. course. My major is Electrical Engineering(it’s more of maths and electronics though). My specialisation is in the field of Communications and Signal Processing. The courses that I have done include Digital Signal Processing Fundamentals of Digital Image Processing Advanced Computing for Electrical Engineers(A compressed version of important CS courses) Advanced Topics in Signal Processing Computer Vision Algorithms for Medical Image Processing I have done many algorithms and machine learning courses on coursera. Some of my previous projects in image processing and computer vision include - Dental Imaging Project with ReDx (MIT Media Lab), built a real time system(designed algorithms) to detect caries(dental cavities) using intra oral camera. This video summarises the complete work. Digit recognition using Adaboost",
            "workshop": "false",
            "imgURL": ""
        }
    ]
}